>>SOURCE FORMAT IS FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORMANCE-LAB.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-RECORDS-PROCESSED PIC 9(8) VALUE 0.
PROCEDURE DIVISION.
DISPLAY "========================================".
DISPLAY "   COBOL MAINFRAME PERFORMANCE LAB".
DISPLAY "========================================".
DISPLAY "INICIO DO PROCESSAMENTO".
PERFORM 50000000 TIMES
    ADD 1 TO WS-RECORDS-PROCESSED
END-PERFORM.
DISPLAY "RECORDS PROCESSED: " WS-RECORDS-PROCESSED.
DISPLAY "FIM DO PROCESSAMENTO".
STOP RUN.
